Vulnerability Test Results/artillery-load-test.yml
config:
  target: "{{ $processEnvironment.TARGET_URL || 'https://xyz.supabase.co' }}"
  phases:
    - duration: 60
      arrivalRate: 100
      name: Baseline Load (100 VUs continuous)
  defaults:
    headers:
      apikey: "{{ $processEnvironment.ANON_KEY }}"
      content-type: "application/json"

scenarios:
  - name: "API Gateway Baseline Load Test"
    flow:
      - get:
          url: "/auth/v1/health"
      - get:
          url: "/rest/v1/profiles?select=count"
